TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/clb/clb_ex13_push_pull.syscfg

/**
 * Import the modules used in this configuration.
 */
const clb         = scripting.addModule("/driverlib/clb.js", {}, false);
const clb1        = clb.addInstance();
const epwm        = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1       = epwm.addInstance();
const outputxbar  = scripting.addModule("/driverlib/outputxbar.js", {}, false);
const outputxbar1 = outputxbar.addInstance();
const TILE        = scripting.addModule("/utilities/clb_tool/clb_syscfg/source/TILE");
const TILE1       = TILE.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
clb1.$name                       = "myTILE1";
clb1.outputsToOverridePeripheral = ["CLB_OUT0","CLB_OUT2"];
clb1.enableCLB                   = true;
clb1.inputsUsed                  = ["CLB_IN0"];

epwm1.$name                 = "myEPWM1";
epwm1.epwm.$assign          = "EPWM1";
epwm1.epwm.epwmaPin.$assign = "GPIO0";
epwm1.epwm.epwmbPin.$assign = "GPIO1";

outputxbar1.$name                            = "myOUTPUTXBAR1";
outputxbar1.muxesUsed                        = ["XBAR_MUX01"];
outputxbar1.mux1Config                       = "XBAR_OUT_MUX01_CLB1_OUT4";
outputxbar1.outputxbar.$assign               = "OUTPUTXBAR1";
outputxbar1.outputxbar.outputxbarPin.$assign = "GPIO24";

TILE.clock_period = 10000;
TILE.sim_duration = 100000000;

TILE1.$name                     = "TILE1";
TILE1.BOUNDARY.$name            = "BOUNDARY0";
TILE1.BOUNDARY.in_repeat_count0 = 50;
TILE1.BOUNDARY.in_repeat_count1 = 50;
TILE1.BOUNDARY.in_repeat_count2 = 50;
TILE1.BOUNDARY.in_period0       = 10000;
TILE1.BOUNDARY.in_duty0         = 5001;
TILE1.BOUNDARY.in_period1       = 1000;
TILE1.BOUNDARY.in_duty1         = 500;
TILE1.BOUNDARY.in_period2       = 3000;
TILE1.BOUNDARY.in_duty2         = 1500;
TILE1.BOUNDARY.in_period3       = 10000;
TILE1.BOUNDARY.in_duty3         = 5001;
TILE1.BOUNDARY.in_repeat_count3 = 50;
TILE1.BOUNDARY.boundaryInput3              = "0";
TILE1.BOUNDARY.boundaryInput4              = "0";
TILE1.BOUNDARY.boundaryInput5              = "0";
TILE1.BOUNDARY.boundaryInput1              = "0";
TILE1.BOUNDARY.boundaryInput2              = "0";
TILE1.LUT_0.$name               = "LUT_0";
TILE1.LUT_1.$name               = "LUT_1";
TILE1.LUT_2.$name               = "LUT_2";
TILE1.FSM_0.$name               = "FSM_0";
TILE1.FSM_0.e0                  = "COUNTER_0.count_match1";
TILE1.FSM_0.eqn_s0              = "e0 ^ s0";
TILE1.FSM_0.eqn_s1              = "e1 ^ s1";
TILE1.FSM_0.e1                  = "COUNTER_1.count_match1";
TILE1.FSM_1.$name               = "FSM_1";
TILE1.FSM_1.e0                  = "COUNTER_2.count_match1";
TILE1.FSM_1.eqn_s0              = "e0 ^ s0";
TILE1.FSM_2.$name               = "FSM_2";
TILE1.COUNTER_0.$name           = "COUNTER_0";
TILE1.COUNTER_0.action          = "Load";
TILE1.COUNTER_0.mode0           = "1";
TILE1.COUNTER_0.mode1           = "1";
TILE1.COUNTER_0.reset           = "COUNTER_0.count_match1";
TILE1.COUNTER_0.match1_val      = "2000";
TILE1.COUNTER_0.event           = "BOUNDARY.in0";
TILE1.COUNTER_1.$name           = "COUNTER_1";
TILE1.COUNTER_1.reset           = "COUNTER_1.count_match1";
TILE1.COUNTER_1.mode0           = "1";
TILE1.COUNTER_1.mode1           = "1";
TILE1.COUNTER_1.match1_val      = "4000";
TILE1.COUNTER_1.event           = "BOUNDARY.in0";
TILE1.COUNTER_1.action          = "Load";
TILE1.COUNTER_2.$name           = "COUNTER_2";
TILE1.COUNTER_2.reset           = "COUNTER_2.count_match1";
TILE1.COUNTER_2.mode0           = "1";
TILE1.COUNTER_2.mode1           = "1";
TILE1.COUNTER_2.match1_val      = "8000";
TILE1.COUNTER_2.event           = "BOUNDARY.in0";
TILE1.COUNTER_2.action          = "Load";
TILE1.OUTLUT_0.$name            = "OUTLUT_0";
TILE1.OUTLUT_0.i0               = "FSM_0.S0";
TILE1.OUTLUT_0.eqn              = "i0";
TILE1.OUTLUT_1.$name            = "OUTLUT_1";
TILE1.OUTLUT_2.$name            = "OUTLUT_2";
TILE1.OUTLUT_2.eqn              = "i0";
TILE1.OUTLUT_2.i0               = "FSM_0.S1";
TILE1.OUTLUT_3.$name            = "OUTLUT_3";
TILE1.OUTLUT_4.$name            = "OUTLUT_4";
TILE1.OUTLUT_4.eqn              = "i0";
TILE1.OUTLUT_4.i0               = "FSM_1.S0";
TILE1.OUTLUT_5.$name            = "OUTLUT_5";
TILE1.OUTLUT_6.$name            = "OUTLUT_6";
TILE1.OUTLUT_7.$name            = "OUTLUT_7";
TILE1.HLC.$name                 = "HLC_0";
TILE1.HLC.e0                    = "BOUNDARY.in0";
TILE1.HLC.program0.$name        = "HLCP_0";
TILE1.HLC.program0.instruct0    = "PULL R0";
TILE1.HLC.program0.instruct1    = "MOV_T1 R0,C0";
TILE1.HLC.program0.instruct2    = "PULL R0";
TILE1.HLC.program0.instruct3    = "MOV_T1 R0,C1";
TILE1.HLC.program0.instruct4    = "PULL R0";
TILE1.HLC.program0.instruct5    = "MOV_T1 R0,C2";
TILE1.HLC.program0.instruct6    = "PULL R0";
TILE1.HLC.program1.$name        = "HLCP_1";
TILE1.HLC.program2.$name        = "HLCP_2";
TILE1.HLC.program3.$name        = "HLCP_3";
TILE1.AOC_0.$name               = "AOC_0";
TILE1.AOC_1.$name               = "AOC_1";
TILE1.AOC_2.$name               = "AOC_2";
TILE1.AOC_3.$name               = "AOC_3";
TILE1.AOC_4.$name               = "AOC_4";
TILE1.AOC_5.$name               = "AOC_5";
TILE1.AOC_6.$name               = "AOC_6";
TILE1.AOC_7.$name               = "AOC_7";
